<?php
include 'dru/bin/php/system.php';

// <--------- Системный класс (выдает путь)
require 'dru/bin/class/sys/CLASS_sys.php';
$sys = new CLASS_sys();
$SYS_PATH = $sys->get('SYS_PATH');

// <--------- mysql 
require $SYS_PATH.'bin/class/mysql/CLASS_mysql.php';
$mysql = new CLASS_mysql();
$mysql->run();

// <--------- BD 
require $SYS_PATH.'bin/class/bd/CLASS_bd.php';
$bd = new CLASS_bd();


//
$TITLE = '';
$SCREEN = 0;

// ------------------------------------------------------------------------------ Работаем с URL
$pieces = explode("?", $_SERVER['REQUEST_URI']);
$url = $pieces[0];


// <--------- 
require $SYS_PATH.'bin/class/list/CLASS_list.php';
$list = new CLASS_list();

echo'<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />
	<title>Движок</title>
	
	<link rel="shortcut icon" href="favicon.ico" />
	
	<meta name="viewport" content="width=device-width, initial-scale=1">
	
	<script src="'.$SYS_PATH.'bin/js/jquery.js"></script>
	
	<!-- Меню -->
	<link rel="stylesheet" href="'.$SYS_PATH.'bin/plugin/mmenu/css/reset.css">
	<link rel="stylesheet" href="'.$SYS_PATH.'bin/plugin/mmenu/css/style.css">
	<script src="'.$SYS_PATH.'bin/plugin/mmenu/js/modernizr.js"></script>
	<script src="'.$SYS_PATH.'bin/plugin/mmenu/js/jquery.menu-aim.js"></script>
	<script src="'.$SYS_PATH.'bin/plugin/mmenu/js/main.js"></script>
	<!-- Конец -->

</head>

<body>
';

// -------------------------------------------------------------------------------------------------------------------     
// ---------------------------------------------------------------------------                                             
// ------------------------------------------------------------------------------                                          
// ---------------------------------------------------------------------------                                             
// -------------------------------------------------------------------------------------------------------------------     
if ($SCREEN == 0) {
	$list->draw_begin();
	$list->draw_content();
	
	require $SYS_PATH.'bin/class/on_list/CLASS_one_big';
	
	echo'
		<h1>Привет мир!</h1>
		<div>
			 19 по 23 октября в Липецкой областной детской библиотеке проходил традиционный Бенефис пятиклассников. На протяжении многих лет, в октябре, библиотекари приглашают на праздник ребят, которые окончили начальную школу.<br /><br /><br /><br />Это своего родапервые шаги пятиклассников по дороге в мир литературы для подростков.<br /><br /><br /><br /><br /><br /><br />
	
	В этом году Бенефис пятиклассников был посвящён 145-летию со дня рождения писателя и поэта Ивана Алексеевича Бунина. <br /><br /><br /><br /><br /><br /><br />
	
	
	В игровой форме ребята совершили литературное путешествие по бунинским местам. В краеведческой гостиной ребята узнали, что будущий лауреат Нобелевской премии родился в Воронеже. «Дом, в котором Иван Алексеевич провёл первые три года своей жизни, сохранился до наших дней. Это одно из старейших зданий в Воронеже», — рассказала библиотекарь.<br /><br /><br /><br />Листая страницы книг, пятиклассники выяснили, что детство и отрочество Бунин провёл в Липецкой области.<br /><br /><br /><br />Он писал о родных местах в рассказе «Антоновские яблоки», фрагменты из которого ребята читали вслух. <br /><br /><br /><br /><br /><br /><br />'.$url.'<br /><br /><br />
	
	
	В медиацентре школьники искали интересные факты из биографии писателя и поэта, используя поисковые системы сети Интернет, а в абонементе 5-7 классов задавали вопросы библиотекарю о его творческом пути. <br /><br /><br /><br /><br />
	
	Проза и стихи Бунина овеяны дыханием музыки и живописи.<br /><br /><br /><br />Он тонко чувствовал звуки природы.<br /><br /><br /><br />В секторе культуры и искусств читали фрагменты прозаических и стихотворных произведений юбиляра под музыку известных композиторов и любовались пейзажами художников.
		</div>
	';
	$list->draw_eend();
}

	
echo'
</body>
</html>';

$mysql->close();

// ======================================================================================================= 
// ======================================================================================================= 
// ======================================================================================================= 
// ===============================================                                                         
// ======================================================================================================= 
// ======================================================================================================= 
// ======================================================================================================= 

?>
